DRAMCO/Plant-Sensor/V2/Software/STM32WB09_lightweight/STM32WB09_lightweight.ioc
#MicroXplorer Configuration settings - do not modify
ADC1.Channel-10\#ChannelRegularConversion=ADC_CHANNEL_VINP1
ADC1.IPParameters=Rank-10\#ChannelRegularConversion,RankArg-10\#ChannelRegularConversion,Channel-10\#ChannelRegularConversion,VoltRange-10\#ChannelRegularConversion,Number-10\#ChannelRegularConversion,NbrOfConversionFlag,master,SelectedChannel
ADC1.NbrOfConversionFlag=1
ADC1.Number-10\#ChannelRegularConversion=ADC_CALIB_NONE
ADC1.Rank-10\#ChannelRegularConversion=1
ADC1.RankArg-10\#ChannelRegularConversion=ADC_RANK_1
ADC1.SelectedChannel=ADC_CHANNEL_VINP1
ADC1.VoltRange-10\#ChannelRegularConversion=ADC_VIN_RANGE_3V6
ADC1.master=1
BSP_IP_NAME=NUCLEO-WB09KE
CAD.formats=
CAD.pinconfig=
CAD.provider=
File.Version=6
GPIO.groupedBy=Group By Peripherals
KeepUserPlacement=false
MMTAppRegionsCount=0
MMTConfigApplied=false
Mcu.CPN=STM32WB09KEV6TR
Mcu.Family=STM32WB0
Mcu.IP0=ADC1
Mcu.IP1=ADV_TRACE
Mcu.IP10=RADIO
Mcu.IP11=RADIO_TIMER
Mcu.IP12=RCC
Mcu.IP13=RNG
Mcu.IP14=SEQUENCER
Mcu.IP15=SPI3
Mcu.IP16=STM32_BLE
Mcu.IP17=SYS
Mcu.IP18=TINY_LPM
Mcu.IP19=USART1
Mcu.IP2=COMMON_BLE
Mcu.IP20=NUCLEO-WB09KE
Mcu.IP3=CORTEX_M0+
Mcu.IP4=DEBUG
Mcu.IP5=MEMORYMAP
Mcu.IP6=MISC
Mcu.IP7=NVIC
Mcu.IP8=PKA
Mcu.IP9=PWR
Mcu.IPNb=21
Mcu.Name=STM32WB09KEVx
Mcu.Package=VFQFPN32
Mcu.Pin0=PB3
Mcu.Pin1=PB2
Mcu.Pin10=RF1
Mcu.Pin11=OSCOUT
Mcu.Pin12=OSCIN
Mcu.Pin13=PB14
Mcu.Pin14=PB13
Mcu.Pin15=PB12
Mcu.Pin16=VP_ADV_TRACE_VS_ADV_TRACE
Mcu.Pin17=VP_COMMON_BLE_VS_Utility_Common_BLE_1.0.0_1.0.0
Mcu.Pin18=VP_MISC_VS_MISC
Mcu.Pin19=VP_PKA_VS_PKA
Mcu.Pin2=PB1
Mcu.Pin20=VP_PWR_VS_SECSignals
Mcu.Pin21=VP_RADIO_TIMER_VS_RADIO
Mcu.Pin22=VP_RNG_VS_RNG
Mcu.Pin23=VP_SEQUENCER_VS_SEQUENCER
Mcu.Pin24=VP_STM32_BLE_VS_BLE_HOST_BC
Mcu.Pin25=VP_SYS_VS_Systick
Mcu.Pin26=VP_TINY_LPM_VS_TINY_LPM
Mcu.Pin27=VP_MEMORYMAP_VS_MEMORYMAP
Mcu.Pin3=PA3
Mcu.Pin4=PA2
Mcu.Pin5=PA1
Mcu.Pin6=PA0
Mcu.Pin7=PA8
Mcu.Pin8=PA9
Mcu.Pin9=PA11
Mcu.PinsNb=28
Mcu.ThirdPartyNb=0
Mcu.UserConstants=
Mcu.UserName=STM32WB09KEVx
MxCube.Version=6.13.0
MxDb.Version=DB.6.0.130
NVIC.ForceEnableDMAVector=true
NVIC.HardFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC.NonMaskableInt_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC.PKA_IRQn=true\:1\:0\:true\:false\:true\:true\:true\:true
NVIC.PendSV_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC.RADIO_TIMER_CPU_WKUP_IRQn=true\:0\:0\:false\:false\:true\:false\:true\:true
NVIC.RADIO_TIMER_ERROR_IRQn=true\:0\:0\:false\:false\:true\:false\:true\:true
NVIC.RADIO_TXRX_IRQn=true\:0\:0\:false\:false\:true\:false\:true\:true
NVIC.RADIO_TXRX_SEQ_IRQn=true\:0\:0\:false\:false\:true\:false\:true\:true
NVIC.SVCall_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC.SysTick_IRQn=true\:3\:0\:false\:false\:true\:false\:true\:false
NVIC.USART1_IRQn=true\:1\:0\:true\:false\:true\:true\:false\:true
OSCIN.Mode=HSE-External-Oscillator
OSCIN.Signal=RCC_OSC_IN
OSCOUT.Mode=HSE-External-Oscillator
OSCOUT.Signal=RCC_OSC_OUT
PA0.GPIOParameters=GPIO_Label
PA0.GPIO_Label=IMU_INT
PA0.Locked=true
PA0.Signal=GPIO_Input
PA1.Mode=Asynchronous
PA1.Signal=USART1_TX
PA11.Mode=Full_Duplex_Master
PA11.Signal=SPI3_MOSI
PA2.Mode=Serial_Wire
PA2.Signal=DEBUG_SWDIO
PA3.Mode=Serial_Wire
PA3.Signal=DEBUG_SWCLK
PA8.Mode=Full_Duplex_Master
PA8.Signal=SPI3_MISO
PA9.Mode=NSS_Signal_Hard_Output
PA9.Signal=SPI3_NSS
PB1.Mode=VINP1
PB1.Signal=ADC1_VINP1
PB12.Mode=LSE-External-Oscillator
PB12.Signal=RCC_OSC32_OUT
PB13.Mode=LSE-External-Oscillator
PB13.Signal=RCC_OSC32_IN
PB14.Mode=Asynchronous
PB14.Signal=USART1_RX
PB2.GPIOParameters=GPIO_Label
PB2.GPIO_Label=BATT_EN
PB2.Locked=true
PB2.Signal=GPIO_Output
PB3.Mode=Full_Duplex_Master
PB3.Signal=SPI3_SCK
PWR.IPParameters=PWR_APC
PWR.PWR_APC=1
PinOutPanel.RotationAngle=0
ProjectManager.AskForMigrate=true
ProjectManager.BackupPrevious=false
ProjectManager.CompilerOptimize=6
ProjectManager.ComputerToolchain=false
ProjectManager.CoupleFile=false
ProjectManager.CustomerFirmwarePackage=
ProjectManager.DefaultFWLocation=true
ProjectManager.DeletePrevious=true
ProjectManager.DeviceId=STM32WB09KEVx
ProjectManager.FirmwarePackage=STM32Cube FW_WB0 V1.1.0
ProjectManager.FreePins=false
ProjectManager.HalAssertFull=false
ProjectManager.HeapSize=0x000
ProjectManager.KeepUserCode=true
ProjectManager.LastFirmware=true
ProjectManager.LibraryCopy=1
ProjectManager.MainLocation=Core/Src
ProjectManager.NoMain=false
ProjectManager.PreviousToolchain=
ProjectManager.ProjectBuild=false
ProjectManager.ProjectFileName=STM32WB09_lightweight.ioc
ProjectManager.ProjectName=STM32WB09_lightweight
ProjectManager.ProjectStructure=
ProjectManager.RegisterCallBack=
ProjectManager.StackSize=0xC00
ProjectManager.TargetToolchain=CMake
ProjectManager.ToolChainLocation=
ProjectManager.UAScriptAfterPath=
ProjectManager.UAScriptBeforePath=
ProjectManager.UnderRoot=false
ProjectManager.functionlistsort=1-SystemClock_Config-RCC-false-HAL-false,2-MX_GPIO_Init-GPIO-false-HAL-true,false-3-MX_RNG_Init-RNG-false-HAL-true,4-MX_RADIO_Init-RADIO-false-HAL-true,5-MX_RADIO_TIMER_Init-RADIO_TIMER-false-HAL-true,6-MX_PKA_Init-PKA-false-HAL-true,7-APPE_Init-STM32_BLE-false-HAL-false,false-8-MX_USART1_UART_Init-USART1-false-HAL-true,9-MX_ADC1_Init-ADC1-false-HAL-true,10-MX_SPI3_Init-SPI3-false-HAL-true,0-MX_CORTEX_M0+_Init-CORTEX_M0+-false-HAL-true,0-MX_PWR_Init-PWR-false-HAL-true
RADIO_TIMER.IPParameters=enableInitialCalibration,periodicCalibrationInterval
RADIO_TIMER.enableInitialCalibration=FALSE
RADIO_TIMER.periodicCalibrationInterval=0
RCC.BLEFreq_VALUE=16000000
RCC.BLEMultSource=RCC_RF_CLK_16M
RCC.CLKI2S3Freq_VALUE=64000000
RCC.CLKSYSFreq_VALUE=32000000
RCC.Clk16MHzFreq_VALUE=16000000
RCC.Clk32MHzFreq_VALUE=32000000
RCC.ClkSMPSFreq_VALUE=4000000
RCC.FamilyName=M
RCC.HSE_VALUE=32000000
RCC.HSI_VALUE=64000000
RCC.IPParameters=BLEFreq_VALUE,BLEMultSource,CLKI2S3Freq_VALUE,CLKSYSFreq_VALUE,Clk16MHzFreq_VALUE,Clk32MHzFreq_VALUE,ClkSMPSFreq_VALUE,FamilyName,HSE_VALUE,HSI_VALUE,LPUARTFreq_VALUE,LSCOPinFreq_Value,LSE_Drive_Capability,LSE_Timout,LSI_VALUE,MCO1PinFreq_Value,RC64MPLLSource,RTCClockSelection,RTCFreq_Value,SYSCLK64Divider,SysCLKFreq_VALUE
RCC.LPUARTFreq_VALUE=16000000
RCC.LSCOPinFreq_Value=32000
RCC.LSE_Drive_Capability=RCC_LSEDRIVE_MEDIUMLOW
RCC.LSE_Timout=100
RCC.LSI_VALUE=32000
RCC.MCO1PinFreq_Value=32000000
RCC.RC64MPLLSource=RCC_LSCOSOURCE_PLL64
RCC.RTCClockSelection=RCC_RTC_WDG_BLEWKUP_CLKSOURCE_LSE
RCC.RTCFreq_Value=32768
RCC.SYSCLK64Divider=RCC_RC64MPLL_DIV2
RCC.SysCLKFreq_VALUE=64000000
RF1.Mode=RF1_Activate
RF1.Signal=RADIO_RF1
SPI3.CalculateBaudRate=16.0 MBits/s
SPI3.Direction=SPI_DIRECTION_2LINES
SPI3.IPParameters=VirtualType,Mode,Direction,CalculateBaudRate,VirtualNSS
SPI3.Mode=SPI_MODE_MASTER
SPI3.VirtualNSS=VM_NSSHARD
SPI3.VirtualType=VM_MASTER
STM32_BLE.ADV_TYPE=HCI_ADV_EVENT_PROP_LEGACY
STM32_BLE.BSP.number=1
STM32_BLE.CFG_BD_ADDRESS_TYPE=HCI_ADDR_STATIC_RANDOM_ADDR
STM32_BLE.CFG_BLE_CONN_EVENT_LENGTH_MAX=4294967295
STM32_BLE.CFG_BLE_CONN_EVENT_LENGTH_MAX_HEXA=0xFFFFFFFF
STM32_BLE.CFG_BLE_NUM_ADV_SETS=3
STM32_BLE.CFG_LPM_SUPPORTED=1
STM32_BLE.CFG_PUBLIC_BD_ADDRESS=0x0280E1887766
STM32_BLE.IPParameters=ADV_TYPE,CFG_PUBLIC_BD_ADDRESS,CFG_BD_ADDRESS_TYPE,CFG_BLE_CONN_EVENT_LENGTH_MAX,CFG_BLE_CONN_EVENT_LENGTH_MAX_HEXA,CFG_BLE_NUM_ADV_SETS,CFG_LPM_SUPPORTED
STM32_BLE0.BSP.STBoard=false
STM32_BLE0.BSP.api=Unknown
STM32_BLE0.BSP.component=
STM32_BLE0.BSP.condition=
STM32_BLE0.BSP.instance=USART1
STM32_BLE0.BSP.ip=(LPU|US)ART
STM32_BLE0.BSP.mode=Asynchronous
STM32_BLE0.BSP.name=Serial Link for Traces
STM32_BLE0.BSP.semaphore=
STM32_BLE0.BSP.solution=USART1
USART1.IPParameters=VirtualMode-Asynchronous
USART1.VirtualMode-Asynchronous=VM_ASYNC
VP_ADV_TRACE_VS_ADV_TRACE.Mode=ADV_TRACE_Enabled
VP_ADV_TRACE_VS_ADV_TRACE.Signal=ADV_TRACE_VS_ADV_TRACE
VP_COMMON_BLE_VS_Utility_Common_BLE_1.0.0_1.0.0.Mode=Utility_Common
VP_COMMON_BLE_VS_Utility_Common_BLE_1.0.0_1.0.0.Signal=COMMON_BLE_VS_Utility_Common_BLE_1.0.0_1.0.0
VP_MEMORYMAP_VS_MEMORYMAP.Mode=CurAppReg
VP_MEMORYMAP_VS_MEMORYMAP.Signal=MEMORYMAP_VS_MEMORYMAP
VP_MISC_VS_MISC.Mode=MISC_Enabled
VP_MISC_VS_MISC.Signal=MISC_VS_MISC
VP_PKA_VS_PKA.Mode=PKA_Activate
VP_PKA_VS_PKA.Signal=PKA_VS_PKA
VP_PWR_VS_SECSignals.Mode=Security/Privilege
VP_PWR_VS_SECSignals.Signal=PWR_VS_SECSignals
VP_RADIO_TIMER_VS_RADIO.Mode=RADIO_Activate
VP_RADIO_TIMER_VS_RADIO.Signal=RADIO_TIMER_VS_RADIO
VP_RNG_VS_RNG.Mode=RNG_Activate
VP_RNG_VS_RNG.Signal=RNG_VS_RNG
VP_SEQUENCER_VS_SEQUENCER.Mode=SEQUENCER_Enabled
VP_SEQUENCER_VS_SEQUENCER.Signal=SEQUENCER_VS_SEQUENCER
VP_STM32_BLE_VS_BLE_HOST_BC.Mode=BLE_Broadcaster
VP_STM32_BLE_VS_BLE_HOST_BC.Signal=STM32_BLE_VS_BLE_HOST_BC
VP_SYS_VS_Systick.Mode=SysTick
VP_SYS_VS_Systick.Signal=SYS_VS_Systick
VP_TINY_LPM_VS_TINY_LPM.Mode=TINY_LPM_Enabled
VP_TINY_LPM_VS_TINY_LPM.Signal=TINY_LPM_VS_TINY_LPM
board=NUCLEO-WB09KE
boardIOC=true
